In [5]:
#!pip install cassandra-driver

In [13]:
import pandas as pd
from cassandra.cluster import Cluster
from etl import make_connection

In [24]:
# Make a connection to a Cassandra instance
session, cluster = make_connection('event_database')

In [25]:
query1 = """SELECT artist, song, length
            FROM artist_song_length
            WHERE sessionId = 338 AND itemInSession = 4
        """
rows = session.execute(query1)
d = rows._current_rows
pd.DataFrame(d)

      artist                             song      length
0  Faithless  Music Matters (Mark Knight Dub)  495.307312

In [26]:
query2 = """SELECT artist, song, firstName, lastName
            FROM artist_song_user
            WHERE sessionId = 182 AND userId = 10;
        """
rows = session.execute(query2, timeout=None)
d = rows._current_rows
pd.DataFrame(d)

,artist,song,firstname,lastname
0,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz
1,Three Drives,Greece 2000,Sylvie,Cruz
2,Sebastien Tellier,Kilometer,Sylvie,Cruz
3,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz

In [27]:
query3 = """
    SELECT firstname, lastname
        FROM first_last_song
        WHERE song = 'All Hands Against His Own';
"""
rows = session.execute(query3, timeout=None)
d = rows._current_rows
pd.DataFrame(d)

    firstname lastname
0  Jacqueline    Lynch
1       Tegan   Levine
2        Sara  Johnson

In [23]:
# Close session and cluster connection
session.shutdown()
cluster.shutdown()